CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/freeConvection/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverBuoyantPimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10;
deltaT          0.05;
writeControl    timeStep;
writeInterval   20;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  no;
maxCo           0.5;

functions
{
      probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            (0.00003 0 0.0001)
            (0.00003 0 0.0529)
        );

        // Fields to be probed
        fields ( p U voidfraction T );

        // Write at same frequency as fields
        writeControl    runTime;//outputTime;
        startTime       $deltaT; // skip probe for time 0
        writeInterval   $deltaT;
    }

    wallHeatFlux1
    {
        type             wallHeatFlux;
        libs             ("libfieldFunctionObjects.so");
        writeControl     writeTime;
    }

    localWallHeatFlux1
    {
        type             surfaces;
        libs             ("libsampling.so");
        writeControl     writeTime;
        surfaceFormat    raw;
        fields
        (
            wallHeatFlux
        );
        interpolationScheme cellPatchConstrained;

        surfaces
        (
            heatExchanger
            {
                type        patch;
                patches     ("heatExchanger");
                traingulate false;
            }
        );
    }

}
// ************************************************************************* //
