CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/freeConvection/CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "(floor|heatExchanger|ceiling|leftAndRight)"
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
